blog/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Test Article Time"], ["body", "Authenticated!"], ["created_at", "2024-09-29 15:12:18.581676"], ["updated_at", "2024-09-29 15:12:18.581676"], ["status", "public"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "I am on Rails!!!!"], ["updated_at", "2024-09-29 03:44:25.768766"], ["id", 1]]