blog/app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Poop"], ["body", "Poooooooop."], ["article_id", 7], ["created_at", "2024-09-29 15:12:26.205997"], ["updated_at", "2024-09-29 15:12:26.205997"], ["status", "public"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)